/**
  ******************************************************************************
  * 文件名          : ChassisInit.c
  * 创建时间        : 2019.07.10
  * 作者            : 任云帆
  ******************************************************************************
  *								文件描述     								   *
  ******************************************************************************
  *	
	* 本文件定义了底盘所有的全局变量和初始化函数。
	*
  ******************************************************************************
  * 1.本代码基于STM32F427IIH6开发，编译环境为Keil 5。
  * 2.本代码只适用于WTRobot一代全向底盘，不建议用作其他用途
  * 3.本代码以UTF-8格式编码，请勿以ANSI编码形式打开
  * 4.本代码最终解释权归哈尔滨工业大学（深圳）南工问天战队所有
  *
  * Copyright (c) 2019 哈尔滨工业大学（深圳）南工问天战队 版权所有
  ******************************************************************************
  */
	
#include "ChassisInit.h"


uint8_t UsartReceiveROS[4];				  				//接受上位机数据
uint8_t UsartReceiveRemote[18];               //遥控器接收的原始数据
uint8_t CanReceiveData[8];                      //CAN接收的电机反馈信息
Chassis_t Chassis = {0};

void ChassisInit()
{	
	for(int i=0;i<4;i++){
		Chassis.Motor[i].KP = 15;
		Chassis.Motor[i].KI = 1;
		Chassis.Motor[i].KD = 1;
		Chassis.Motor[i].outputMax = 5000;
		Chassis.Motor[i].real_w =0;
	}
}
